// Original CP949 text tables at 0x134514 and 0x135f14.
export const HELP_TEXT = [
  "[게임 줄거리]\n\rV은하\rg를 여행하는 음악을 사랑하는 \rB외계인\rg이 다양한행성을 찾아다니며 음악이없는 행성 주민들에게 음악의 존재를 알려주어 그들의 \rV무미 건조한\rg \rB마음\rg을\rV치유\rg해준다는 내용. 온 은하에 음악이 널리 알려질 수 있도록 하자!",
  "[조작 방법]\n\rg1.메뉴이동 : \rU방향키\n\rg2.확인 : \rUOk/MagicN키\n\rg3.이전메뉴 : \rU취소키\n\rg4.페이지변경 : \rU*,#키\n\rg5.노트히트 : \rU숫자키\n  \rV이지\rg : \rU1,2,3\n  \rB하드\rg : \rU1~6\n  \rR크레이지\rg : \rU1~9\n",
  "[게임모드]\n\rV이지\rg : \rU3키\rg를 사용하는 초보자 전용 모드.\n\rB하드\rg : \rU1~6키\rg까지 사용하며 일반적인 리듬게임 유저라면 어렵지 않음.\n\rR크레이지\rg : \rU1~9키\rg를 모드 사용하는 버전으로 가장 높은 난이도를 자랑.\n",
  "[음표]\n\rg게임중에 노트와 함께 떨어지는 \rB음표\rg를 정확히 맞추면 음표를 얻게 됩니다.\n이 음표는 행성을 치유하거나 최신곡을 다운 받는데 이용 됩니다.",
  "[행성 치유]\n\rg음악 선택 화면에서 \rV#키\rg를 눌러 음표로 행성을 치유할 수 있습니다. 치유된 행성은 \rB음악선택 시\rg\rV좌, 우키\rg로 선택 할 수 있습니다. 행성은 특별한옵션과 보너스가 있어 좀더 높은 점수를 획득 할 수 있습니다.",
  "[싱크 조절(1)]\n\rg처음 시작할 때, 음악이 느리거나 빨리 시작할 경우, 싱크를 조절하여 노트와 음악을 맞추는기능입니다. \rB환경설정\rg에서 싱크를 조절하거나 \rB게임 중\rg에 \rV메뉴\rg를 통해서 조절 할 수 있습니다.",
  "[싱크 조절(2)]\n\rg음악과 노트가 시간이 지나며, 조금씩 느려지거나 빨라질 경우, 싱크를 조절하여 노트와 음악을 맞추는기능입니다. \rB환경설정\rg에서 싱크를 조절하거나 \rB게임 중\rg에 \rV메뉴\rg를 통해서 조절 할 수 있습니다.",
  "[랭킹 등록]\n\rg자신이 플레이한 음악의 점수 총합을 등록하여 실력을 겨룰 수 있습니다.등록은 이름과 학교를 선택하게 되며 자신의 순위, 학교 순위 등을 볼 수있습니다.\rB랭킹 업데이트\rg는매일 \rV하루에 한번씩\rg 일어납니다.",
  "[최신곡보기]\n\rg리듬스타에 제공되는 음악외에도 지속적으로 \rV최신 곡\rg이 업데이트 됩니다.최신곡은 음표 또는 유료로구매가 가능합니다.",
  "[정보이용료]\n\rg네트워크 사용량에 따라 기본통신료외 1패킷(512Byte)당 0원, 추가곡 다운로드 1건당 300원/500원/700원의 정보이용료가 부과됩니다.",
  "[해외과금 안내]\n\rg해외에서 네트웍 이용시 해외 요금이 적용됩니다.",
  "[SHOW폰 경고뮨]\n\rgWCDMA(3G) 단말은 멀티태스킹을 지원하기 때문에 통화중일때 일시정지가 자동으로 되지않습니다.",
  "[제작정보]\n\rU제   명\rD:리듬스타\n\rU이용등급\rD:전체이용가\n\rU제작연월일\rD:2008.05.01\n\rU상호\rD:(주)에이앤비소프트\n\rU등급분류번호\rD:\n  제MO-080130-044호\n\rU신고번호(등록번호)\rD:\n   제2006-000011호"
];
export const CREDITS_TEXT = "[게임 문의]\n\rg게임버전: \rUVer 1.0.3\n\rg제 작 사: \n \rU(주)에이앤비소프트\n\rg문의전화: \n \rU02-2026-0087\n\rg문의메일: \n \rUgame@anbgames.com\n\rg홈페이지: \n \rUwww.anbgames.com";
